Revit 2026 API

# BuiltInFailuresFluidFailures Class

---

Failures about Fluid.

SystemObject Autodesk.Revit.DBBuiltInFailuresFluidFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class FluidFailures
```
```vb
Public NotInheritable Class FluidFailures
```
```cpp
public ref class FluidFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type FluidFailures = class end
```

The BuiltInFailuresFluidFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UndefinedFluidType | The fluid type '[Type Name]' is not defined |

#### Reference

Autodesk.Revit.DB Namespace